src/cf/Enums/ДальнейшиеДействияПоВзаимодействиюЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияПоВзаимодействиюЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулируйтеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулируйтеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулируйтеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеЗавершенияОбработкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПередачуДанныхРегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеПередачуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеКорректировкуСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеОтказОтГашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздайтеМестаФормированияПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформируйтеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеКорректировкуПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитеСтатусМестаФормированияПартий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСписанияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожае</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОстатковПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатораАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтказовПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийНаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРеестраЭлеваторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследованийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииСоздание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочныйРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭлеватор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулированиеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартиийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзДругихПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииНаОсновеБумажногоСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПоРезультатамГосмониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПриСбореУрожая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПробАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ДействиеССообщениемЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействиеССообщениемЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеПолучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияЗЕРНОСлужебныйКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает адрес сервера ЗЕРНО.
//
// Возвращаемое значение:
//  Строка - адрес сервера ЗЕРНО.
//
Функция АдресСервера() Экспорт
	
	РежимРаботыСТестовымКонтуром = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.РежимРаботыСТестовымКонтуромЗЕРНО();
	
	ПараметрыОптимизации = ИнтеграцияЗЕРНОВызовСервера.ПараметрыОптимизации();
	Если РежимРаботыСТестовымКонтуром Тогда
		Возврат ПараметрыОптимизации.АдресСервераТестовыйКонтур;
	Иначе
		Возврат ПараметрыОптимизации.АдресСервера;
	КонецЕсли;
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов МОТП.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
// * Таймаут - Число - Таймаут соединения.
// * Порт - Число - Порт соединения.
// * Сервер - Строка - Адрес сервера.
// * ПредставлениеСервиса - Строка - Представления сервиса.
//
Функция ПараметрыОтправкиHTTPЗапросов() Экспорт
	
	АдресСервера = АдресСервера();
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           АдресСервера);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          30);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ФГИС ""Зерно""'"));
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует структуру передачи данных
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * Ссылка - ОпределяемыйТип.ОбъектыСинхронизацииЗЕРНО, СправочникСсылка, Неопределено - Передаваемый документ
// * Организация - ОпределяемыйТип.Организация - Организация
// * Подразделение - ОпределяемыйТип.Подразделение, Неопределено - Подразделение
// * Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО, Неопределено - Вид операции
// * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС, Неопределено - Вид продукции
// * ЭтоЭлеватор - Булево - Операция выполняется от лица элеватора
// * ДополнительныеПараметры - Произвольный -
Функция ПараметрыОбработкиСообщений() Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Ссылка");
	ПараметрыОбработки.Вставить("Операция");
	ПараметрыОбработки.Вставить("ДальнейшееДействие", ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.ПередайтеДанные"));
	ПараметрыОбработки.Вставить("Организация",        ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	ПараметрыОбработки.Вставить("Подразделение");
	ПараметрыОбработки.Вставить("ПараметрыЗапроса");
	ПараметрыОбработки.Вставить("ВидПродукции");
	ПараметрыОбработки.Вставить("ЭтоЭлеватор", Ложь);
	ПараметрыОбработки.Вставить("ИмяЗапросаЗерно");
	
	Возврат ПараметрыОбработки;
	
КонецФункции

// Возвращает структуру параметров обновления статуса.
// 
// Параметры:
//  ПараметрыОбновленияСтатуса - Неопределено - Параметры обновления статуса
// 
// Возвращаемое значение:
//  Структура, Неопределено - Параметры обновления статуса:
// * Статус - ПеречислениеСсылка
// * СтатусОбработки - ПеречислениеСсылка
// * ОперацияКвитанции - ПеречислениеСсылка
// * ПротоколОбмена - СправочникСсылка.ЗЕРНОПрисоединенныеФайлы
// * ПараметрыЗапроса - Структура
Функция ПараметрыОбновленияСтатуса(ПараметрыОбновленияСтатуса = Неопределено) Экспорт
	
	Если ПараметрыОбновленияСтатуса = Неопределено Тогда
		ПараметрыОбновленияСтатуса = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбновленияСтатуса.Вставить("Статус");
	ПараметрыОбновленияСтатуса.Вставить("СтатусОбработки");
	ПараметрыОбновленияСтатуса.Вставить("ОперацияКвитанции");
	ПараметрыОбновленияСтатуса.Вставить("ПротоколОбмена");
	ПараметрыОбновленияСтатуса.Вставить("ПараметрыЗапроса");
	
	Возврат ПараметрыОбновленияСтатуса;
	
КонецФункции

// Получает значение свойства переданного констекста
// 
// Параметры:
// 	Контекст - ФормаКлиентскогоПриложения - Передаваемый контекст.
// 	ИмяСвойства - Строка - Имя свойства контекста
// Возвращаемое значение:
// 	Произвольный, Неопределено - Значение свойства контекста.
Функция ЗначениеСвойстваКонтекста(Контекст, ИмяСвойства) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	ИсточникДанных = Контекст;
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		ИсточникДанных = Контекст.Объект;
	КонецЕсли;
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникДанных, ИмяСвойства) Тогда
		ВозвращаемоеЗначение = ИсточникДанных[ИмяСвойства];
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СерверныеОповещения

Функция ИмяСерверногоОповещенияВыполненОбменДанныим() Экспорт
	Возврат "ИнтеграцияЗЕРНО.ВыполненОбменДанными";
КонецФункции

Функция ДанныеОповещенияВыполненОбменДанныим() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Изменения", Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ОтветственныеЗаПодписаниеСообщений

Функция ПараметрыПриложенияОтветственныеЗаПодписаниеСообщений() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ПараметрыИнициализированы",         Ложь);
	ВозвращаемоеЗначение.Вставить("ЯвляетсяОтветственным",             Ложь);
	ВозвращаемоеЗначение.Вставить("ВремяСледующейПроверки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ВремяСледующегоОбновленияНастроек", Неопределено);
	ВозвращаемоеЗначение.Вставить("НастройкиОтветственного",           Неопределено);
	ВозвращаемоеЗначение.Вставить("ОткрытаФормаСообщений",             Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РезультатПериодическогоПолученияДанных() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ЯвляетсяОтветственным",       Ложь);
	ВозвращаемоеЗначение.Вставить("НастройкиОтветственного",     Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеАвтоподписания",        Неопределено);
	ВозвращаемоеЗначение.Вставить("ОрганизацииИмеющиеСообщения", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",        Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура УстановитьВремяСледующегоОбновленияНастроек(Параметры) Экспорт
	
	Параметры.ВремяСледующегоОбновленияНастроек = Параметры.ВремяСледующегоОбновленияНастроек + 3600;
	
КонецПроцедуры

Функция ОперацияПодписываетсяНаКлиентеБезПодтверждения(Операция) Экспорт
	
	Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатора")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартий")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросОтказовПогашенийСДИЗ")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПогашенийСДИЗ")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследований")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПроб")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗ")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗагрузкаОстатковПартий")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииИзменениеСтатуса") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьМинимальнуюДатуСообщенияПоОранизации(ОрганизацииИмеющиеСообщения, ДанныеСообщения) Экспорт
	
	Организация   = ДанныеСообщения.Организация;
	Подразделение = ДанныеСообщения.Подразделение;
	
	Если Подразделение = Неопределено Тогда
		Подразделение = "";
	КонецЕсли;
	
	Если ОрганизацииИмеющиеСообщения = Неопределено Тогда
		ОрганизацииИмеющиеСообщения = Новый Соответствие();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСообщения.ДатаМодификацииУниверсальная) Тогда
		ДатаСообщения = ДанныеСообщения.ДатаМодификацииУниверсальная;
	Иначе
		ДатаСообщения = ДанныеСообщения.ДатаСоздания;
	КонецЕсли;
	
	ПодразделенияИмеющиеСообщения = ОрганизацииИмеющиеСообщения[Организация];
	
	Если ПодразделенияИмеющиеСообщения = Неопределено Тогда
		ПодразделенияИмеющиеСообщения = Новый Соответствие();
		ОрганизацииИмеющиеСообщения[Организация] = ПодразделенияИмеющиеСообщения;
	КонецЕсли;
	
	ТекущаяДатаСообщения = ПодразделенияИмеющиеСообщения[Подразделение];
	Если ТекущаяДатаСообщения = Неопределено
		Или ТекущаяДатаСообщения > ДатаСообщения Тогда
		ПодразделенияИмеющиеСообщения[Подразделение] = ДатаСообщения;
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиОтветственногоЗаПодписаниеСообщений() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("ЯвляетсяОтветственным",           Ложь);
	ВозвращаемоеЗначение.Вставить("ВсеОрганизацииВсеПодразделения",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ПодразделенияПоВсемОрганизациям", Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("ОрганизацииПоВсемПодразделениям", Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("ОрганизацииИПодразделения",       Новый Соответствие());
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

#КонецОбласти

// Формирует структуру свойств для уточнения данных конверта SOAP и
// алгоритмов подписания и хеширования.
// 
// Возвращаемое значение:
// Структура - (См. ЭлектроннаяПодписьКлиентСервер.ПараметрыXMLDSig).
//
Функция ПараметрыXMLDSig() Экспорт
	
	ПараметрыXMLDSig = ЭлектроннаяПодписьКлиентСервер.ПараметрыXMLDSig();
	
	ПараметрыXMLDSig.ИмяАлгоритмаПодписи = "GOST R 34.10-2001" "GOST R 34.11-2012";
	ПараметрыXMLDSig.OIDАлгоритмаПодписи = "1.2.643.2.2.3"     "1.2.643.7.1.1.3.2";
	
	ПараметрыXMLDSig.ИмяАлгоритмаХеширования = "GOST R 34.11-94" "GOST R 34.11-12";
	ПараметрыXMLDSig.OIDАлгоритмаХеширования = "1.2.643.2.2.9"   "1.2.643.7.1.1.2.2";
	
	ПараметрыXMLDSig.АлгоритмПодписи     = "http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411" "urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256";
	ПараметрыXMLDSig.АлгоритмХеширования = "http://www.w3.org/2001/04/xmldsig-more#gostr3411"               "urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256";
	
	Возврат ПараметрыXMLDSig;
	
КонецФункции

// Возвращает операции обмена с ИС МП"), разбитые на категории
// 
// Возвращаемое значение:
//  Соответствие - Операции передачи данных.
//
Функция КатегорииОпераций() Экспорт
	
	ПередачаДанных = Новый Соответствие;
	
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатора"),
		НСтр("ru = 'Запрос классификатора НСИ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатораАбстрактнаяОперация"),
		НСтр("ru = 'Запрос классификатора НСИ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий"),
		НСтр("ru = 'Запрос сведений о партиях'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗагрузкаОстатковПартий"),
		НСтр("ru = 'Запрос сведений о партиях'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРеестраЭлеваторов"),
		НСтр("ru = 'Запрос сведений из реестра элеваторов'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийРасчетСтатуса"),
		НСтр("ru = 'Запрос сведений о партиях'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении"),
		НСтр("ru = 'Запрос сведений о партиях на хранении'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗ"),
		НСтр("ru = 'Запрос сведений о СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗАбстрактнаяОперация"),
		НСтр("ru = 'Запрос сведений о СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартий"),
		НСтр("ru = 'Запрос на получение мест формирования партий'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартийАбстрактнаяОперация"),
		НСтр("ru = 'Запрос на получение мест формирования партий'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследований"),
		НСтр("ru = 'Запрос на получение результатов исследований'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследованийАбстрактнаяОперация"),
		НСтр("ru = 'Запрос на получение результатов исследований'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПроб"),
		НСтр("ru = 'Запрос на получение актов отбора проб'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПробАбстрактнаяОперация"),
		НСтр("ru = 'Запрос на получение актов отбора проб'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПогашенийСДИЗ"),
		НСтр("ru = 'Запрос на получение погашений СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросОтказовПогашенийСДИЗ"),
		НСтр("ru = 'Запрос на получение отказов погашений СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗ"),
		НСтр("ru = 'Передача сведений для отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке"),
		НСтр("ru = 'Передача сведений для отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений для отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ"),
		НСтр("ru = 'Передача сведений для аннулирования отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Передача сведений для аннулирования отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений для аннулирования отказа погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочный"),
		НСтр("ru = 'Передача сведений для оформления корректировочного СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочныйРасчетСтатуса"),
		НСтр("ru = 'Передача сведений для оформления корректировочного СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Передача сведений для оформления корректировки СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений для оформления корректировки СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений для оформления СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗИмпорт"),
		НСтр("ru = 'Передача сведений для оформления СДИЗ (Импорт в РФ)'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭкспорт"),
		НСтр("ru = 'Передача сведений для оформления СДИЗ (Экспорт из РФ)'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗРФ"),
		НСтр("ru = 'Передача сведений для оформления СДИЗ (На территории РФ)'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭлеватор"),
		НСтр("ru = 'Передача сведений для оформления СДИЗ (Элеватор)'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзДругихПартий"),
		НСтр("ru = 'Передача сведений о формировании партий из других партий'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииНаОсновеБумажногоСДИЗ"),
		НСтр("ru = 'Передача сведений о формировании партий на основе бумажного носителя СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПоРезультатамГосмониторинга"),
		НСтр("ru = 'Передача сведений о формировании партий по результатам Государственного мониторинга'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзОстатков"),
		НСтр("ru = 'Передача сведений о формировании партий из остатков'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИмпорт"),
		НСтр("ru = 'Передача сведений о формировании партий при импорте в РФ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПроизводство"),
		НСтр("ru = 'Передача сведений о формировании партий при производстве'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПриСбореУрожая"),
		НСтр("ru = 'Передача сведений о формировании партий при сборе урожая'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗ"),
		НСтр("ru = 'Передача сведений о погашении СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений о погашении СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулированиеРасчетСтатуса"),
		НСтр("ru = 'Передача сведений об аннулировании погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулирование"),
		НСтр("ru = 'Передача сведений об аннулировании погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.КорректировкаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Передача сведений о корректировке погашения СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартии"),
		НСтр("ru = 'Передача сведений о списании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартиийРасчетСтатуса"),
		НСтр("ru = 'Передача сведений о списании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСписанияПартии"),
		НСтр("ru = 'Передача сведений об аннулировании списания партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожае"),
		НСтр("ru = 'Передача сведений о собранном урожае'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для передачи сведений о собранном урожае'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеАннулирование"),
		НСтр("ru = 'Передача сведений об аннулировании сведений о собранном урожае'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииСоздание"),
		НСтр("ru = 'Передача сведений о создании места формирования партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для передачи сведений о местах формирования партий'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииУдаление"),
		НСтр("ru = 'Передача сведений об удалении места формирования партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииРасчетСтатуса"),
		НСтр("ru = 'Передача сведений о формировании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартии"),
		НСтр("ru = 'Передача сведений о формировании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗ"),
		НСтр("ru = 'Передача сведений об аннулировании СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПриКорректировке"),
		НСтр("ru = 'Передача сведений об аннулировании СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для передачи сведений об аннулировании СДИЗ'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартии"),
		НСтр("ru = 'Передача сведений об аннулировании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеПартииПриКорректировке"),
		НСтр("ru = 'Передача сведений об аннулировании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииИзменениеСтатуса"),
		НСтр("ru = 'Передача сведений об изменении статуса места формирования партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для передачи сведений об аннулировании партии'"));
	ПередачаДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПартииРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для передачи сведений об аннулировании СДИЗ и партии'"));
	
	ПолучениеДанных = Новый Соответствие();
	
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатора"),
		НСтр("ru = 'Получение классификатора НСИ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатораАбстрактнаяОперация"),
		НСтр("ru = 'Получение классификатора НСИ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий"),
		НСтр("ru = 'Получение сведений о партиях'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗагрузкаОстатковПартий"),
		НСтр("ru = 'Получение сведений о партиях'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРеестраЭлеваторов"),
		НСтр("ru = 'Получение сведений из реестра элеваторов'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийРасчетСтатуса"),
		НСтр("ru = 'Получение сведений о партиях'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении"),
		НСтр("ru = 'Получение сведений о партиях на хранении'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗ"),
		НСтр("ru = 'Получение сведений о СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗАбстрактнаяОперация"),
		НСтр("ru = 'Получение сведений о СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартий"),
		НСтр("ru = 'Получение сведений о местах формирования партий'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартийАбстрактнаяОперация"),
		НСтр("ru = 'Получение сведений о местах формирования партий'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследований"),
		НСтр("ru = 'Получение сведений о результатах исследований'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследованийАбстрактнаяОперация"),
		НСтр("ru = 'Получение сведений о результатах исследований'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПроб"),
		НСтр("ru = 'Получение сведений о актах отбора проб'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПробАбстрактнаяОперация"),
		НСтр("ru = 'Получение сведений о актах отбора проб'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПогашенийСДИЗ"),
		НСтр("ru = 'Получение сведений о погашении СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросОтказовПогашенийСДИЗ"),
		НСтр("ru = 'Получение сведений об отказах погашений СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗ"),
		НСтр("ru = 'Получение результата обработки отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке"),
		НСтр("ru = 'Получение результата обработки отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ"),
		НСтр("ru = 'Получение результата обработки аннулирования отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Получение результата обработки аннулирования отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки аннулирования отказа погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочный"),
		НСтр("ru = 'Получение результата обработки оформления корректировочного СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочныйРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки оформления корректировочного СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Получение результата обработки оформления корректировки СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки оформления корректировки СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗИмпорт"),
		НСтр("ru = 'Получение результата обработки оформления СДИЗ (Импорт в РФ)'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭкспорт"),
		НСтр("ru = 'Получение результата обработки оформления СДИЗ (Экспорт из РФ)'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗРФ"),
		НСтр("ru = 'Получение результата обработки оформления СДИЗ (На территории РФ)'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭлеватор"),
		НСтр("ru = 'Получение результата обработки оформления СДИЗ (Элеватор)'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзДругихПартий"),
		НСтр("ru = 'Получение результата обработки формирования партий из других партий'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииНаОсновеБумажногоСДИЗ"),
		НСтр("ru = 'Получение результата обработки формирования партий на основе бумажного носителя СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПоРезультатамГосмониторинга"),
		НСтр("ru = 'Получение результата обработки формирования партий по результатам Государственного мониторинга'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзОстатков"),
		НСтр("ru = 'Получение результата обработки формирования партий из остатков'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИмпорт"),
		НСтр("ru = 'Получение результата обработки формирования партий при импорте в РФ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПроизводство"),
		НСтр("ru = 'Получение результата обработки формирования партий при производстве'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПриСбореУрожая"),
		НСтр("ru = 'Получение результата обработки формирования партий при сборе урожая'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗ"),
		НСтр("ru = 'Получение результата обработки погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.КорректировкаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки корректировки погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулирование"),
		НСтр("ru = 'Получение результата обработки аннулирования погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулированиеРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки аннулирования погашения СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартии"),
		НСтр("ru = 'Получение результата обработки списании партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартиийРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки списании партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСписанияПартии"),
		НСтр("ru = 'Получение результата обработки аннулирования списания партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожае"),
		НСтр("ru = 'Получение результата обработки внесения сведений о собранном урожае'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для получения результата обработки внесения сведений собранном урожае'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеАннулирование"),
		НСтр("ru = 'Получение результата обработки аннулирования сведений о собранном урожае'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииСоздание"),
		НСтр("ru = 'Получение результата обработки сведений о создании места формирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для получения результата обработки мест формирования партий'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииУдаление"),
		НСтр("ru = 'Получение результата обработки удаления места формирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки формирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартии"),
		НСтр("ru = 'Получение результата обработки формирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗ"),
		НСтр("ru = 'Получение результата аннулирования СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПриКорректировке"),
		НСтр("ru = 'Получение результата аннулирования СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки аннулирования СДИЗ'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартии"),
		НСтр("ru = 'Получение результата аннулирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеПартииПриКорректировке"),
		НСтр("ru = 'Получение результата аннулирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Получение результата аннулирования партии'"));
	ПолучениеДанных.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПартииРасчетСтатуса"),
		НСтр("ru = 'Получение результата обработки аннулирования СДИЗ и партии'"));
	
	ПодтверждениеПолучения = Новый Соответствие();
	
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатора"),
		НСтр("ru = 'Подтверждение получения классификатора НСИ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросКлассификатораАбстрактнаяОперация"),
		НСтр("ru = 'Подтверждение получения классификатора НСИ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий"),
		НСтр("ru = 'Подтверждение получения сведений о партиях'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗагрузкаОстатковПартий"),
		НСтр("ru = 'Подтверждение получения сведений о партиях'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРеестраЭлеваторов"),
		НСтр("ru = 'Подтверждение получения сведений реестра элеваторов'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений о партиях'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении"),
		НСтр("ru = 'Подтверждение получения сведений о партиях на хранении'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений о СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросСДИЗАбстрактнаяОперация"),
		НСтр("ru = 'Подтверждение получения сведений о СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартий"),
		НСтр("ru = 'Подтверждение получения сведений о местах формирования партий'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросМестФормированияПартийАбстрактнаяОперация"),
		НСтр("ru = 'Подтверждение получения сведений о местах формирования партий'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследований"),
		НСтр("ru = 'Подтверждение получения сведений о результатах исследований'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросРезультатовИсследованийАбстрактнаяОперация"),
		НСтр("ru = 'Подтверждение получения сведений о результатах исследований'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПроб"),
		НСтр("ru = 'Подтверждение получения сведений о актах отбора проб'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросАктовОтбораПробАбстрактнаяОперация"),
		НСтр("ru = 'Подтверждение получения сведений о актах отбора проб'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПогашенийСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений о погашении СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросОтказовПогашенийСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений об отказах погашений СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗ"),
		НСтр("ru = 'Подтверждение получения результата обработки отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке"),
		НСтр("ru = 'Подтверждение получения результата обработки отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения результата обработки отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ"),
		НСтр("ru = 'Подтверждение получения результата обработки аннулирования отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Подтверждение получения результата обработки аннулирования отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения результата обработки аннулирования отказа погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочный"),
		НСтр("ru = 'Подтверждение получения результата обработки оформления корректировочного СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗКорректировочныйРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения результата обработки оформления корректировочного СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке"),
		НСтр("ru = 'Подтверждение получения результата обработки оформления корректировки СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеКорректировкиСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения результата обработки оформления корректировки СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗИмпорт"),
		НСтр("ru = 'Подтверждение получения сведений оформления СДИЗ (Импорт в РФ)'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭкспорт"),
		НСтр("ru = 'Подтверждение получения сведений оформления СДИЗ (Экспорт из РФ)'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗРФ"),
		НСтр("ru = 'Подтверждение получения сведений оформления СДИЗ (На территории РФ)'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ОформлениеСДИЗЭлеватор"),
		НСтр("ru = 'Подтверждение получения сведений оформления СДИЗ (Элеватор)'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзДругихПартий"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий из других партий'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииНаОсновеБумажногоСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий на основе бумажного носителя СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПоРезультатамГосмониторинга"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий по результатам Государственного мониторинга'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИзОстатков"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий из остатков'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииИмпорт"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий при импорте в РФ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПроизводство"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий при производстве'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииПриСбореУрожая"),
		НСтр("ru = 'Подтверждение получения сведений формирования партий при сборе урожая'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.КорректировкаПогашенияСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений корректировки погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулирование"),
		НСтр("ru = 'Подтверждение получения сведений аннулирования погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ПогашениеСДИЗАннулированиеРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений аннулирования погашения СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартии"),
		НСтр("ru = 'Подтверждение получения сведений списания партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.СписаниеПартиийРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений списания партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСписанияПартии"),
		НСтр("ru = 'Подтверждение получения сведений аннулирования списания партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожае"),
		НСтр("ru = 'Подтверждение получения сведений о собранном урожае'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для подтверджения получения сведений о собранном урожае'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ВнесениеСведенийОСобранномУрожаеАннулирование"),
		НСтр("ru = 'Подтверждение получения аннулирования сведений о собранном урожае'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииСоздание"),
		НСтр("ru = 'Подтверждение получения сведений о создании места формирования партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Расчет статуса для подтверджения получения результата обработки мест формирования партий'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.МестоФормированияПартииУдаление"),
		НСтр("ru = 'Подтверждение получения сведений удаления места формирования партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартииРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений о формирования партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ФормированиеПартии"),
		НСтр("ru = 'Подтверждение получения сведений о формирования партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗ"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПриКорректировке"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании СДИЗ'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартии"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеПартииПриКорректировке"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеФормированияПартииРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании партии'"));
	ПодтверждениеПолучения.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.АннулированиеСДИЗПартииРасчетСтатуса"),
		НСтр("ru = 'Подтверждение получения сведений об аннулировании СДИЗ и партии'"));
	
	Категории = Новый Структура;
	Категории.Вставить("ПередачаДанных",         ПередачаДанных);
	Категории.Вставить("ПолучениеДанных",        ПолучениеДанных);
	Категории.Вставить("ПодтверждениеПолучения", ПодтверждениеПолучения);
	
	Возврат Категории;
	
КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  Описание - Строка - Описание операции
//  НомерВерсии - Число - Номер версии
//  Постфикс - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции.
//
Функция ОписаниеОперации(Описание, НомерВерсии = Неопределено, Постфикс = Неопределено) Экспорт
	
	Если НомерВерсии = Неопределено Тогда
		ТекстВозврата = Описание;
		ТекстВозврата = СтрШаблон(НСтр("ru = '%1'"), Описание);
	ИначеЕсли НомерВерсии <> Неопределено  Тогда
		ТекстВозврата = СтрШаблон(НСтр("ru = '%1. Версия %2'"), Описание, НомерВерсии);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ТекстВозврата = ТекстВозврата + ". " + Постфикс;
	КонецЕсли;
	
	Возврат ТекстВозврата;

КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО - Операция обмена с ЗЕРНО
//  ДополнительноеОписание - Строка, Неопределено - Дополнительное описание операции
//  НомерВерсии - Число - Номер версии
//  Постфикс - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПередачиДанных(Операция, ДополнительноеОписание = Неопределено, НомерВерсии = Неопределено, Постфикс = Неопределено) Экспорт
	
	ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.Отправка");
	Возврат ОписаниеОперацииПоДействиюССообщением(Операция, ДействиеССообщением, ДополнительноеОписание, НомерВерсии, Постфикс);
	
КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО - Операция обмена с ЗЕРНО
//  ДополнительноеОписание - Строка, Неопределено - Дополнительное описание операции
//  НомерВерсии - Число - Номер версии
//  Постфикс - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПолученияДанных(Операция, ДополнительноеОписание = Неопределено, НомерВерсии = Неопределено, Постфикс = Неопределено) Экспорт
	
	ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.ПолучениеРезультата");
	Возврат ОписаниеОперацииПоДействиюССообщением(Операция, ДействиеССообщением, ДополнительноеОписание, НомерВерсии, Постфикс);
	
КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО - Операция обмена с ЗЕРНО
//  ДополнительноеОписание - Строка, Неопределено - Дополнительное описание операции
//  НомерВерсии - Число - Номер версии
//  Постфикс - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПодтвержденияПолучения(Операция, ДополнительноеОписание = Неопределено, НомерВерсии = Неопределено, Постфикс = Неопределено) Экспорт
	
	ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.ПодтверждениеПолучения");
	Возврат ОписаниеОперацииПоДействиюССообщением(Операция, ДействиеССообщением, ДополнительноеОписание, НомерВерсии, Постфикс);
	
КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО - Операция обмена с ЗЕРНО
//  ДействиеССообщением - ПеречислениеСсылка.ДействиеССообщениемЗЕРНО -
//  ДополнительноеОписание - Строка, Неопределено - Дополнительное описание операции
//  НомерВерсии - Число - Номер версии
//  Постфикс - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПоДействиюССообщением(Операция, ДействиеССообщением, ДополнительноеОписание = Неопределено, НомерВерсии = Неопределено, Постфикс = Неопределено) Экспорт
	
	КатегорииОпераций = КатегорииОпераций();
	
	Если ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.Отправка") Тогда
		ОписаниеОперации = КатегорииОпераций.ПередачаДанных.Получить(Операция);
	ИначеЕсли ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.ПолучениеРезультата") Тогда
		ОписаниеОперации = КатегорииОпераций.ПолучениеДанных.Получить(Операция);
	ИначеЕсли ДействиеССообщением = ПредопределенноеЗначение("Перечисление.ДействиеССообщениемЗЕРНО.ПодтверждениеПолучения") Тогда
		ОписаниеОперации = КатегорииОпераций.ПодтверждениеПолучения.Получить(Операция);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительноеОписание) Тогда
		РазделительОписания = "";
		Если СтрНачинаетсяС(ДополнительноеОписание, ",") Или СтрНачинаетсяС(ДополнительноеОписание, " ") Тогда
			РазделительОписания = "";
		Иначе
			РазделительОписания = " ";
		КонецЕсли;
		ОписаниеОперации = СтрШаблон("%1%3%2", ОписаниеОперации, ДополнительноеОписание, РазделительОписания);
	КонецЕсли;
	
	Возврат ОписаниеОперации(ОписаниеОперации, НомерВерсии, Постфикс);
	
КонецФункции

// Формирует текст счетчика по формату N из M.
//
// Параметры:
// 	ТекущийНомерГруппы - Число - текущий номер в группе.
// 	КоличествоГрупп - Число - Всего элементов в группе.
// Возвращаемое значение:
// 	Строка - Сформированный текст счетчика.
Функция ТекстКоличествоИзГруппы(ТекущийНомерГруппы, КоличествоГрупп) Экспорт
	Если КоличествоГрупп > ТекущийНомерГруппы Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 из %2'"), ТекущийНомерГруппы, КоличествоГрупп);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПредставлениеНомераСтраницы(НомерСтраницы) Экспорт
	
	Если ЗначениеЗаполнено(НомерСтраницы) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Страница %1'"), НомерСтраницы);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

#КонецОбласти
